       identification division.
       program-id. Program1.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.


           perform 1000-mainline.
           goback.
       
       1000-mainline.
            display 'example'.  
            display 'hello'.
            display 'hello again'.  
       end program Program1.